/*****************************************************************
 * 实验名称及内容：花样流水灯
 * 配套书籍：《深入浅出STM8单片机入门、进阶与应用实例》
 * 交流QQ群： 305348768
 * 淘宝店铺： https://520mcu.taobao.com/
 * 实验平台及编程人员：思修电子工作室"祥云小王子"开发版 Long
******************************************************************/
#include "iostm8s208mb.h"//主控芯片的头文件
/************************常用数据类型定义*************************/
#define u8  uint8_t
#define u16 uint16_t
#define u32 uint32_t
typedef unsigned char    uint8_t;
typedef unsigned short   uint16_t;
typedef unsigned long    uint32_t;
/************************端口/引脚定义区域***********************/

/***********************用户自定义数据区域***********************/
u8 table[]={0xF6,0xF9,0xF6,0xF9,0xFF,0xF0,0xFF,0xF0,0x01};
//花样流水灯数组“table[]”
/*************************函数声明区域***************************/
void delay(u16 Count);//延时函数声明
void table_LED(void);//花样数组流水灯函数声明
/**************************主函数区域****************************/
int main( void )
{
  PI_DDR=0xFF;//配置PI端口为输出模式
  PI_CR1=0xFF;//配置PI端口为推挽输出模式
  PI_CR2=0x00;//配置PI端口低速率输出
  PI_ODR=0x00;//初始化PI端口全部输出低电平
  while(1)
  {
      table_LED();//高低位“碰头”再分开随后全灭全亮两次“花样”效果
  }
}
/****************************************************************/
//延时函数delay()，有形参Count用于控制延时函数执行次数，无返回值
/****************************************************************/
void delay(u16 Count)
{
  u8 i,j;
  while (Count--)//Count形参控制延时次数
  {
    for(i=0;i<50;i++)
      for(j=0;j<20;j++);
  }
}
/****************************************************************/
//花样流水灯函数table_LED()，无形参，无返回值
/****************************************************************/
void table_LED(void)
{
   u8 x=0;
   do 
   { 
      PI_ODR=table[x];//取数组数值写入PI输出寄存器
      delay(500);//延时状态保持（便于观察）
      x++; //数组下标控制变量x自增
    }
   while(table[x]!=0x01);//判断是否到达数组末尾“0x01”
}